<HEAD>
<TITLE>Arezzo - Manuel</TITLE>

<BODY>


<table width="760" border="0">
  <tr>
    <td>
      <h1 align="left"><font size="+3" >Manuel</FONT></H1>
      <h2 align="left"><font size="+2">Note importante</FONT></H2>
      <div align="left">Arezzo n'est compl&egrave;tement op&eacute;rationnel que 
        si son serveur d&eacute;di&eacute; fonctionne.
        Si cela ne semble pas &ecirc;tre le cas, n'h&eacute;sitez pas &agrave; 
        contacter <A href="mailto:pierre.jouvelot@mines-paristech.fr">l'&eacute;quipe d'Arezzo</A>. </DIV>
      <h2 align="left"><font size="+2" >G&eacute;n&eacute;ralit&eacute;s</FONT></H2>
      <div align="left"> 
        <p>Arezzo permet de faciliter l'apprentissage de 
      l'harmonie classique, de l'art de la m&eacute;lodie et du contrepoint :</P></DIV>
      <ul>
        <li><i>Harmonie</I>. Les r&egrave;gles du jeu consistent &agrave; cr&eacute;er une ligne 
          de basse, et ensuite de l'harmoniser. Cela veut dire qu'il vous faut 
          d&eacute;terminer les 4 notes requises par accord pour les lignes de basse, 
          t&eacute;nor, alto et soprano. Vous devez proc&eacute;der en fonction des informations 
          de chiffrage qui sp&eacute;cifient, en dessous de chaque accord, quel est le 
          renversement d'accord qui doit &ecirc;tre utilis&eacute;. Le syst&egrave;me peut 
          vous aider en fournissant automatiquement le degr&eacute; de chaque 
          accord.<br>
          <br>
        <li><i>M&eacute;lodie</I>. Il vous faut ici d&eacute;terminer une ligne 
          m&eacute;lodique correcte selon les canons classiques. Une fois celle-ci 
          introduite dans Arezzo, par exemple dans la voix de soprano, vous pourrez 
          demander &agrave; Arezzo de v&eacute;rifier si elle est bien construite. 
          <br>
          <br>
        <li><i>Contrepoint</I>. Arezzo 
        permet de v&eacute;rifier les contrepoints de premi&egrave;re esp&egrave;ce (note contre 
        note, avec une note par mesure) ayant jusqu'&agrave; 4 voix. Entrez les voix 
        dans Arezzo, par exemple dans la basse et le soprano, puis demandez &agrave; 
        Arezzo de v&eacute;rifier leur coh&eacute;rence. </LI></UL>
      <p> Une fois que vous pensez avoir cr&eacute;&eacute; une harmonisation, une m&eacute;lodie 
        ou un contrepoint correct, vous pouvez tester celui-ci, demander des conseils 
        si vous &ecirc;tes en panne, l'&eacute;couter ou le sauver sur le serveur d'Arezzo. 
      <p>Arezzo fournit &eacute;galement des outils de communication vous permettant 
        : 
      <ul>
        <li>d'envoyer par e-mail vos partitions pour demander de l'aide ou de 
          vous les envoyer pour impression ;<br>
          <br>
        <li>de partager votre partition avec d'autres lors de travaux en groupe 
          ;<br>
          <br>
        <li>de discuter avec les autres utilisateur d'Arezzo gr&acirc;e &agrave; 
          un syst&egrave;me de chat int&eacute;gr&eacute;. Vous pouvez &eacute;galement, 
          si vous le souhaitez, utiliser les syst&egrave;mes de communication 
          vocale sur Internet, tel <a href="http://www.microsoft.com/windows/netmeeting/default.asp">NetMeeting</A> de Microsoft. </LI></UL>
      <h2>Partitions</H2>
      <p>La notation de partition utilis&eacute;e par Arezzo est classique. Pour 
        chaque mesure sont indiqu&eacute;s entre parenth&egrave;ses le num&eacute;ro 
        de la mesure et le num&eacute;ro du premier accord de cette mesure. Cela 
        peut vous &ecirc;tre utile pour mieux analyser les messages &eacute;mis 
        par Arezzo. 
      <p>Des objets vari&eacute;s peuvent &ecirc;tres s&eacute;lectionn&eacute;s, et 
      color&eacute;s en fonction, en cliquant sur le bouton gauche de la souris ou &agrave; 
      l'aide des fl&egrave;ches du clavier : </P> 
          <table border="0" height="93" width=500>
            <tr> 
              <td> 
                <div align="center"><IMG height=100 src="./App/Images/Accord.jpg" width=51></DIV></TD>
              <td> 
                <div align="center"><IMG height=100 src="./App/Images/Notes.jpg" width=46></DIV></TD>
              <td> 
                <div align="center"><IMG height=100 src="./App/Images/Digit.jpg" width=45></DIV></TD></TR>
            <tr> 
              <td> 
                <div align="center"><i>Accords</I> en vert</DIV></TD>
              <td> 
                <div align="center"><i>Notes 
            </I>en rouge</DIV></TD>
              <td> 
                <div align="center"><i>Chiffres</I>, dans un renversement, en 
            rouge</DIV></TD></TR></TABLE>
      <p> Il est alors possible d'ex&eacute;cuter les op&eacute;rations courantes 
        suivantes : 
      <ul>
        <li> Sur les notes:<br>
          <br>
          <ul>
            <li> Bouger une note dans un accord en la faisant 
          glisser avec le bouton gauche. 
            <li> Effacer la note s&eacute;lectionn&eacute;e en appuyant sur 
          la touche [Delete] ou [Backspace]. 
            <li> Cr&eacute;er une note dans un accord en cliquant sur l'accord avec le 
              bouton droit (ou avec le bouton gauche tout en maintenant la touch 
              Control enfonc&eacute;e) &agrave; la position requise dans l'accord. Utiliser 
              d'abord le boutton Insertion pour s&eacute;lectionner le mode souhait&eacute;.<br>
              <br></LI></UL>
        <li>Sur les accords (Vous pouvez utiliser la barre de d&eacute;filement sous 
          la partition pour changer la position courante.) : <br>
          <br>
          <ul>
            <li> Effacer l'accord s&eacute;lectionn&eacute; en appuyant sur 
          la touche [Delete] ou [Backspace] (d&eacute;s&eacute;lectionner d'abord la note 
          s&eacute;lectionn&eacute;e, s'il le faut). Il n'est pas possible d'effacer la 
          derni&egrave;re note restante. 
            <li> Ins&eacute;rer un nouvel accord apr&egrave;s un accord en 
          cliquant sur le boutton droit (ou sur le bouton gauche tout en 
          maintenant la touch Control enfonc&eacute;e). Il faut d'abord s&eacute;lectionner 
          "Accord" avec le boutton Insertion. </LI></UL></LI></UL>
      <h2>Accords, notes et chiffres</H2>
      <p> Le menu <i>Alt&eacute;ration</I> permet de choisir l'alt&eacute;ration 
        souhait&eacute;e (<i>b</I>, <i>bb</I>, , <i>#,</I> <i>X</I>) sur la note ou chiffre s&eacute;lectionn&eacute;.</P>
      <p align="left">Le menu <i>Renversement</I> permet de modifier le renversement 
        de l'accord s&eacute;lectionn&eacute; (<i>8, 3, 5</I>, <i>5 3</I>, <i>6</I>, 
        <i>6 3</I>, <i>6 4</I> et septi&egrave;mes). Les septi&egrave;mes sont 
        regroup&eacute;es dans un menu &agrave; part (<i>7, 6 5</I>, <i>4 3</I>, 
        <i>2, 7+</I>,<i> 6 5/</I>, <i>+6</I>, <i>+4</I>). Attention : 
      les septi&egrave;mes diminu&eacute;es ne sont pas prises en compte par cette version 
      d'Arezzo. </P>
      <p align="left">Le menu <i>Dur&eacute;e</I> permet de modifier la dur&eacute;e 
        de l'accord s&eacute;lectionn&eacute; (<i>1</I>, <i>2</I>, <i>4</I>, <i>8</I>, 
        <i>16</I>, <i>32</I>). En fait, une 
      seule note s&eacute;lectionn&eacute;e dans l'accord modifie tout l'accord. Fonctionne 
      aussi pour une note simple.</P>
      <p align="left">Le menu <i>Insertion</I> g&egrave;re l'insertion d'objets, note ou 
      accord, apr&egrave;s un objet de m&ecirc;me type en cliquant sur le bouton droit de la 
      souris (ou cliquer sur le bouton gauche tout en maintenant la touche 
      Control enfonc&eacute;e) :</P>
      <ul>
        <li>Pour ins&eacute;rer un <i>Accord</I>, vous pouvez choisir entre un 
          accord ne contenant qu'une note de <i>Basse</I> et un accord <i>Complet</I>.<br>
          <br>
        <li><i>Note la plus basse</I> 
        permet de cr&eacute;er la note la plus basse dans l'accord courant. 
        <li><i>Basse</I>, pour ajouter 
        une note dans la voix de basse. 
        <li><i>T&eacute;nor</I>
        <li><i>Alto</I>
        <li><i>Soprano</I> </LI></UL>
      <h2></H2>
      <h2>Fonctions</H2>
      <p>Les diff&eacute;rentes op&eacute;rations permises par Arezzo sont accessibles &agrave; 
        partir des menus pr&eacute;sents dans la barre sup&eacute;rieure. 
      <p>Le menu <i>Fichier</I> traite de la gestion de vos partitions sur le 
        site d'Arezzo pour : 
      <ul>
        <li>Cr&eacute;er une partition vide (<i>Nouveau</I>). 
        <li><i>Charger</I> un fichier 
        particulier. 
        <li>R&eacute;cup&eacute;rer la version pr&eacute;c&eacute;demment sauv&eacute;e 
          de la partition (<i>Version</I> <i>pr&eacute;c&eacute;dente</I>). 
        <li><i>Effacer</I> un fichier 
        particulier. 
        <li><i>Sauver</I> la pi&egrave;ce 
        dans l'Atelier. Une seule version est conserv&eacute;e par site client. 
        <li>Sauver la pi&egrave;ce sous un autre nom (<i>Sauver</I> <i>sous</I>). 
      </LI></UL>
      <p>Le menu <i>Op&eacute;rations</I> 
      contient l'intelligence musicale d'Arezzo pour : </P>
      <ul>
        <li><i>V&eacute;rifier</I> : 
          <ul>
            <li>l'<i>Harmonie</I>. Des 
          indications sont donn&eacute;es sur ce qui est incorrect d'un point de vue 
          harmonique dans la pi&egrave;ce. 
            <li>la <i>M&eacute;lodie</I>. Des 
          indications sont donn&eacute;es sur la fa&ccedil;on de cr&eacute;er une bonne ligne 
          m&eacute;lodique de votre choix (e.g. la basse). 
            <li>le <i>Contrepoint</I>. 
          Une fois les voix s&eacute;lectionn&eacute;es (jusqu'&agrave; 4), des indications sont 
          donn&eacute;es sur les erreurs contrapuntiques les plus courantes. 
        </LI></UL>
        Les messages apparaissent dans la fen&ecirc;tre du bas. 
        <li>Le menu <i>Conseiller</I> peut &ecirc;tre utilis&eacute; pour aider 
          &agrave; &eacute;liminer les erreures sur les accords (pour l'<i>Harmonie</I>) 
          ou sur la m&eacute;lodie (<i>M&eacute;lodie</I>). Les messages apparaissent dans la 
        fen&ecirc;tre du bas. 
        <li><i>Jouer</I> la partition 
        sur le synth&eacute;tiseur MIDI local. Vous pouvez sp&eacute;cifier les voix 
        particuli&egrave;res &agrave; &eacute;couter, ce qui peut &ecirc;tre tr&egrave;s utile lors de l'&eacute;tude des 
        voix interm&eacute;diaires. Si le navigateur Web n'est pas convenablement 
        configur&eacute; pour reconna&icirc;tre les fichiers .MID (le type MIME est 
        "application/x-mid"), charger le fichier sur l'ordinateur. </LI></UL>
      <p>Le menu <i>Communications</I> 
      permet de communiquer sur Internet afin :</P>
      <ul>
        <li><i>Envoyer un mail</I> : 
          <ul>
            <li>contenant la <i>Partition </I>courante -- il lancera 
          automatiquement le navigateur Web de votre destinataire sur votre 
          partition. Cela vous permet de contacter les divers instructeurs en 
          leur posant des questions ; 
            <li>au format <i>PS</I> (le 
          fichier est en fait renvoy&eacute; &agrave; l'utilisateur pour lui permettre ensuite 
          de l'imprimer en tant que fichier attach&eacute; d'un mail, ceci car 
          l'impression directement &agrave; partir d'Arezzo n'est pas possible) ; 
            <li>au format <i>MIDI </I>-- 
          cela vous permettra, par la suite, d'envoyer votre fichier MIDI &agrave; qui 
          vous le souhaitez ; 
            <li>au format <i>ABC</I> (regardez sur <a href="http://www.gre.ac.uk/%7Ec.walshaw/abc">ce site</A> pour plus d'informations sur <i>abc</I>).<br>
              <br></LI></UL>
        <li><i>Partager</I> votre session avec d'autres utilisateurs (votre partition, 
          et les modifications qui y sont faites, est partag&eacute;e par tous 
          les ordinateurs connect&eacute;s sur le canal partag&eacute;. A noter 
          que seules les actions souris et celles d&eacute;clench&eacute;es par 
          les menus dont l'&eacute;tiquette commence par "*" seront 
          automatiquement propag&eacute;es aux machines du canal en cours. Pour 
          les autres modifications (e.g., un changement de tonalite), il convient 
          d'utiliser l'op&eacute;ration Synchroniser) : 
          <ul>
            <li>en cr&eacute;ant un <i>Nouveau</I> canal ; 
            <li>en rejoignant un canal existant (<i>Joindre</I>). </LI></UL>
        <li><i>Synchroniser</I> votre 
        partition partag&eacute;e avec les autres correspondants. 
        <li>Lister les <i>Participants</I> actuels de la session. 
        <li>Sortir du mode partag&eacute; et revenir en mode <i>Local</I>.<br>
          <br>
        <li><i>Discuter</I> avec d'autres utilisateurs (une fen&ecirc;tre de discussion 
          s'ouvrira -- tous les messages inscrits seront visibles depuis tous 
          les ordinateurs connect&eacute;s) : 
          <ul>
            <li>en cr&eacute;ant un <i>Nouveau</I> canal ; 
            <li>en rejoignant un canal existant (<i>Joindre</I>). </LI></UL></LI></UL>
      <h2>Aide utilisateur</H2>
      <p>Le menu <i>Pr&eacute;f&eacute;rences 
      </I>d&eacute;finit vos options par d&eacute;faut :</P>
      <ul>
        <li>Modifier la <i>Tonalit&eacute;</I> : 
          <ul>
            <li>en changeant le <i>Mode</I> (<i>Majeur</I> ou <i>Mineur</I>) ; 
            <li>en changeant l'<i>Alt&eacute;ration</I> (<i>bb</I>, <i>b</I>, 
              , <i>#</I>, <i>X</I>) ; 
            <li>en changeant la <i>Note</I> (<i>do</I>, <i>r&eacute;</I>, <i>mi</I>, 
              <i>fa</I>, <i>sol, la , 
          si</I>). </LI></UL>
        <li>Modifier la <i>Mesure</I> 
        de la partition. 
        <li>Modifier le <i>Tempo</I> 
        de la partition. 
        <li>Choisir vos <i>Instrument</I>s General MIDI. Vous pouvez utiliser 
          le son <i>Piano</I> pour toutes votre voix, ou 
        s&eacute;lectionner un instrument diff&eacute;rent pour chaque voix, ce qui est utile 
        pour bien la distinguer des autres. 
        <li>Choisir la <i>Langue</I> utilis&eacute;e (<i>Anglais</I> ou <i>Fran&ccedil;ais</I>) pour l'affichage des messages. 
        <li>S&eacute;lectionner les options<i> </I>d<i>'Affichage</I>. 
        <li>S&eacute;lectionner les <i>V&eacute;rifications</I> particuli&egrave;res 
          d'harmonie, de m&eacute;lodie ou de contrapoint &agrave; effectuer lors 
          de l'utilisation du menu <i>Op&eacute;rations</I>. Veuillez vous r&eacute;f&eacute;rer &agrave; votre 
        manuel de th&eacute;orie musicale si vous avez besoin de plus d'explication sur 
        ces notions, ou n'h&eacute;sitez pas &agrave; contacter votre instructeur. </LI></UL>
      <h2></H2>
      <p>Le menu <i>?</I> contient 
      :</P>
      <ul>
        <li>le <i>Glossaire</I>, qui peut &ecirc;tre utile pour comprendre un 
          mot particulier utilis&eacute; dans la fen&ecirc;te du bas. S&eacute;lectionner 
          le mot &agrave; la souris puis cliquer sur <i>Glossaire</I>. Une fen&ecirc;tre 
          glossaire est ouverte dans laquelle il est possible ensuite d'&eacute;crire 
          un mot &agrave; expliquer (appuyer ensuite sur la touche Entr&eacute;e). 
          Un mot s&eacute;lectionn&eacute; &agrave; la souris dans la fen&ecirc;tre 
          glossaire sera aussi expliquer (appuyer sur le bouton <i>Expliquer</I>). 
        <li>le <i>Manuel</I>, qui fait 
        apparaitre cette page. 
        <li><i>A</I> <i>propos</I> donne des informations sur Arezzo. 
      </LI></UL></TD></TR></TABLE>
<h1 align="left">&nbsp;</H1>


</BODY>

